fratyaldiz/stm32wb55-projects/WB55_BLE_Phone_Control/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* My_P2P_Server */
  uint8_t               Switch_c_Notification_Status;
  /* Diagnostics_Service */
  /* USER CODE BEGIN CUSTOM_APP_Context_t */

  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define SW1_POLL_PERIOD_MS       20U
#define SW1_DEBOUNCE_SAMPLES     3U

#define RESET_REASON_PINRST   (1U << 0)
#define RESET_REASON_BORRST   (1U << 1)
#define RESET_REASON_SFTRST   (1U << 2)
#define RESET_REASON_IWDGRST  (1U << 3)
#define RESET_REASON_WWDGRST  (1U << 4)
#define RESET_REASON_LPWRRST  (1U << 5)
#define RESET_REASON_OBLRST   (1U << 6)

/*
 * FE48 Software Reset command:
 * Only the exact 2-byte magic value A5 5A is accepted.
 */
#define SOFTWARE_RESET_MAGIC_BYTE_0    0xA5U
#define SOFTWARE_RESET_MAGIC_BYTE_1    0x5AU
#define SOFTWARE_RESET_DELAY_MS        200U

/*
 * FE4A Clear Diagnostics command:
 * Only the exact 2-byte magic value C3 3C is accepted.
 */
#define CLEAR_DIAG_MAGIC_BYTE_0        0xC3U
#define CLEAR_DIAG_MAGIC_BYTE_1        0x3CU

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[512];
uint8_t NotifyCharData[512];
uint16_t Connection_Handle;
/* USER CODE BEGIN PV */

static uint32_t Switch_LastPollTick = 0U;

static uint8_t Switch_LastRawState[3] = {0U, 0U, 0U};
static uint8_t Switch_StableState[3] = {0U, 0U, 0U};
static uint8_t Switch_SameSampleCount[3] = {0U, 0U, 0U};

/* 0xFF = henuz telefona gonderilmedi */
static uint8_t Switch_LastNotifiedState[3] =
{
  0xFFU,
  0xFFU,
  0xFFU
};
static uint16_t ResetReason = 0U;

/* BLE connection diagnostics (cleared on MCU reset). */
static uint8_t BleConnectionActive = 0U;
static uint16_t BleConnectionCount = 0U;
static uint16_t BleDisconnectionCount = 0U;
static uint32_t BleConnectionStartTick = 0U;

/* Debounced button press counters (cleared on MCU reset). */
static uint16_t ButtonPressCount[3] = {0U, 0U, 0U};

/*
 * Software reset is armed in the BLE write callback and executed later
 * from Custom_APP_Process(), outside the BLE event callback.
 */
static uint8_t SoftwareResetPending = 0U;
static uint32_t SoftwareResetRequestTick = 0U;

extern ADC_HandleTypeDef hadc1;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* My_P2P_Server */
static void Custom_Switch_c_Update_Char(void);

static void Custom_Switch_c_Send_Notification(void);

/* Diagnostics_Service */

/* USER CODE BEGIN PFP */

HAL_StatusTypeDef Custom_APP_Read_Internal_Temperature(
    int32_t *temperature_c
);
static HAL_StatusTypeDef Custom_APP_Read_Internal_ADC(
    uint32_t *vref_raw,
    uint32_t *temp_raw
);
static void Custom_APP_Update_Connection_Stats(void);
static void Custom_APP_Update_Button_Counters(void);
static void Custom_APP_Update_Connection_Duration(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */

  /* USER CODE END CUSTOM_STM_App_Notification_1 */
  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* My_P2P_Server */
    case CUSTOM_STM_LED_C_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_LED_C_READ_EVT */

      /*
       * Simdilik read isteginde ek bir islem yapmiyoruz.
       */

      /* USER CODE END CUSTOM_STM_LED_C_READ_EVT */
      break;

    case CUSTOM_STM_LED_C_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN CUSTOM_STM_LED_C_WRITE_NO_RESP_EVT */

      /*
       * iPhone -> FE41 -> STM32
       *
       * 2 byte komut:
       *
       * Byte 0 = LED numarasi
       * Byte 1 = durum
       *
       * 01 01 -> LD1 ON
       * 01 00 -> LD1 OFF
       *
       * 02 01 -> LD2 ON
       * 02 00 -> LD2 OFF
       *
       * 03 01 -> LD3 ON
       * 03 00 -> LD3 OFF
       */

      if ((pNotification->DataTransfered.pPayload != NULL) &&
          (pNotification->DataTransfered.Length >= 2U))
      {
        uint8_t led_number;
        uint8_t led_state;
        GPIO_PinState gpio_state;

        led_number = pNotification->DataTransfered.pPayload[0];
        led_state  = pNotification->DataTransfered.pPayload[1];

