fratyaldiz/stm32wb55-projects/WB55_BLE_Phone_Control/STM32_WPAN/App/custom_app.c
        /*
         * Sadece 00 ve 01 kabul et.
         */
        if (led_state <= 0x01U)
        {
          gpio_state =
              (led_state == 0x01U)
              ? GPIO_PIN_SET
              : GPIO_PIN_RESET;

          switch (led_number)
          {
            case 0x01U:
              HAL_GPIO_WritePin(
                  LD1_GPIO_Port,
                  LD1_Pin,
                  gpio_state
              );
              break;

            case 0x02U:
              HAL_GPIO_WritePin(
                  LD2_GPIO_Port,
                  LD2_Pin,
                  gpio_state
              );
              break;

            case 0x03U:
              HAL_GPIO_WritePin(
                  LD3_GPIO_Port,
                  LD3_Pin,
                  gpio_state
              );
              break;
            default:
              /*
               * Gecersiz LED numarasi.
               */
              break;
          }
        }
      }

      /* USER CODE END CUSTOM_STM_LED_C_WRITE_NO_RESP_EVT */
      break;

    case CUSTOM_STM_LED_C_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_LED_C_WRITE_EVT */

      /* USER CODE END CUSTOM_STM_LED_C_WRITE_EVT */
      break;

    case CUSTOM_STM_SWITCH_C_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SWITCH_C_NOTIFY_ENABLED_EVT */

      Custom_App_Context.Switch_c_Notification_Status = 1U;

      /*
       * iPhone Notify'i actiginda mevcut SW1 durumunu
       * bir kez hemen gondermeye zorla.
       */
      Switch_LastNotifiedState[0] = 0xFFU;
      Switch_LastNotifiedState[1] = 0xFFU;
      Switch_LastNotifiedState[2] = 0xFFU;

      /* USER CODE END CUSTOM_STM_SWITCH_C_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_SWITCH_C_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SWITCH_C_NOTIFY_DISABLED_EVT */

      /*
       * iPhone FE42 notification aboneligini kapatti.
       */
      Custom_App_Context.Switch_c_Notification_Status = 0U;
      Switch_LastNotifiedState[0] = 0xFFU;
      Switch_LastNotifiedState[1] = 0xFFU;
      Switch_LastNotifiedState[2] = 0xFFU;

      /* USER CODE END CUSTOM_STM_SWITCH_C_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_VDDA_C_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_VDDA_C_READ_EVT */

    {
      uint32_t vdda_mv;
      uint16_t vdda_value;

      /*
       * VREFINT kullanarak VDDA degerini mV cinsinden oku.
       */
      if (Custom_APP_Read_VDDA(&vdda_mv) == HAL_OK)
      {
        /*
         * FE43 characteristic 2 byte oldugu icin
         * uint16_t olarak gonder.
         */
        vdda_value = (uint16_t)vdda_mv;

        /*
         * Little-endian:
         * Byte 0 = LSB
         * Byte 1 = MSB
         */
        UpdateCharData[0] =
            (uint8_t)(vdda_value & 0x00FFU);

        UpdateCharData[1] =
            (uint8_t)((vdda_value >> 8) & 0x00FFU);

        (void)Custom_STM_App_Update_Char(
            CUSTOM_STM_VDDA_C,
            (uint8_t *)UpdateCharData
        );
      }
    }
      /* USER CODE END CUSTOM_STM_VDDA_C_READ_EVT */
      break;

    case CUSTOM_STM_UPTIME_C_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_UPTIME_C_READ_EVT */
    {
      uint32_t uptime_seconds;

      /*
       * HAL_GetTick() milisaniye cinsindendir.
       * BLE uzerinden uptime'i saniye olarak gonder.
       */
      uptime_seconds = HAL_GetTick() / 1000U;

      /*
       * 32-bit little-endian:
       * Byte 0 = en dusuk byte
       * Byte 3 = en yuksek byte
       */
      UpdateCharData[0] =
          (uint8_t)(uptime_seconds & 0x000000FFU);

      UpdateCharData[1] =
          (uint8_t)((uptime_seconds >> 8) & 0x000000FFU);

      UpdateCharData[2] =
          (uint8_t)((uptime_seconds >> 16) & 0x000000FFU);

      UpdateCharData[3] =
          (uint8_t)((uptime_seconds >> 24) & 0x000000FFU);

      (void)Custom_STM_App_Update_Char(
          CUSTOM_STM_UPTIME_C,
          (uint8_t *)UpdateCharData
      );
    }

      /* USER CODE END CUSTOM_STM_UPTIME_C_READ_EVT */
      break;

    case CUSTOM_STM_RESET_C_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_RESET_C_READ_EVT */

      /*
       * FE45 value is captured and written once in Custom_APP_Init().
       * The read-permit handler only allows the client read.
       */

      /* USER CODE END CUSTOM_STM_RESET_C_READ_EVT */
      break;

    /* Diagnostics_Service */
    case CUSTOM_STM_CONN_STATS_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_CONN_STATS_READ_EVT */

      /*
       * FE46 BLE Connection Stats is refreshed immediately before
       * the client read is allowed.
       */
      Custom_APP_Update_Connection_Stats();

      /* USER CODE END CUSTOM_STM_CONN_STATS_READ_EVT */
      break;

    case CUSTOM_STM_BUTTON_CNT_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_BUTTON_CNT_READ_EVT */

      /*
       * FE47 Button Press Counters is refreshed immediately before
       * the client read is allowed.
       */
      Custom_APP_Update_Button_Counters();

      /* USER CODE END CUSTOM_STM_BUTTON_CNT_READ_EVT */
      break;

    case CUSTOM_STM_SW_RESET_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SW_RESET_WRITE_EVT */

      /*
       * Accept only the exact 2-byte magic command A5 5A.
       * Invalid values are ignored so an accidental write cannot reset the MCU.
       */
      if ((pNotification->DataTransfered.pPayload != NULL) &&
          (pNotification->DataTransfered.Length == 2U) &&
          (pNotification->DataTransfered.pPayload[0] ==
              SOFTWARE_RESET_MAGIC_BYTE_0) &&
          (pNotification->DataTransfered.pPayload[1] ==
              SOFTWARE_RESET_MAGIC_BYTE_1))
      {
        if (SoftwareResetPending == 0U)
        {
          SoftwareResetRequestTick = HAL_GetTick();
          SoftwareResetPending = 1U;
        }
      }

      /* USER CODE END CUSTOM_STM_SW_RESET_WRITE_EVT */
      break;

    case CUSTOM_STM_CONN_TIME_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_CONN_TIME_READ_EVT */

      /*
       * FE49 Connection Duration is refreshed immediately before
       * the client read is allowed.
       */
      Custom_APP_Update_Connection_Duration();

      /* USER CODE END CUSTOM_STM_CONN_TIME_READ_EVT */
      break;

    case CUSTOM_STM_CLEAR_DIAG_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_CLEAR_DIAG_WRITE_EVT */

