fratyaldiz/stm32wb55-projects/WB55_BLE_Phone_Control/STM32_WPAN/App/custom_app.c
      /*
       * Accept only the exact 2-byte magic command C3 3C.
       *
       * Clear:
       *   - BLE connection count
       *   - BLE disconnection count
       *   - SW1/SW2/SW3 press counters
       *
       * Keep:
       *   - current BLE connection state
       *   - FE49 current connection duration
       *   - FE45 reset reason
       */
      if ((pNotification->DataTransfered.pPayload != NULL) &&
          (pNotification->DataTransfered.Length == 2U) &&
          (pNotification->DataTransfered.pPayload[0] ==
              CLEAR_DIAG_MAGIC_BYTE_0) &&
          (pNotification->DataTransfered.pPayload[1] ==
              CLEAR_DIAG_MAGIC_BYTE_1))
      {
        BleConnectionCount = 0U;
        BleDisconnectionCount = 0U;

        ButtonPressCount[0] = 0U;
        ButtonPressCount[1] = 0U;
        ButtonPressCount[2] = 0U;

        /*
         * Refresh cached GATT values immediately.
         * FE46 keeps Byte0 = current connection state.
         */
        Custom_APP_Update_Connection_Stats();
        Custom_APP_Update_Button_Counters();
      }

      /* USER CODE END CUSTOM_STM_CLEAR_DIAG_WRITE_EVT */
      break;

    case CUSTOM_STM_NOTIFICATION_COMPLETE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */

      /* USER CODE END CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */

      /* USER CODE END CUSTOM_STM_App_Notification_default */
      break;
  }
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

  /* USER CODE END CUSTOM_STM_App_Notification_2 */
  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */

      /*
       * BLE connection kuruldu.
       * Sayaclar MCU resetlenene kadar RAM'de tutulur.
       */
      BleConnectionActive = 1U;
      BleConnectionStartTick = HAL_GetTick();

      if (BleConnectionCount < 0xFFFFU)
      {
        BleConnectionCount++;
      }

      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */

      /*
       * BLE connection koptugunda notification
       * durumunu sifirla ve diagnostics sayacini guncelle.
       */
      Custom_App_Context.Switch_c_Notification_Status = 0U;
      BleConnectionActive = 0U;
      BleConnectionStartTick = 0U;

      if (BleDisconnectionCount < 0xFFFFU)
      {
        BleDisconnectionCount++;
      }

      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */

  ResetReason = 0U;
  BleConnectionActive = 0U;
  BleConnectionCount = 0U;
  BleDisconnectionCount = 0U;
  BleConnectionStartTick = 0U;
  ButtonPressCount[0] = 0U;
  ButtonPressCount[1] = 0U;
  ButtonPressCount[2] = 0U;
  SoftwareResetPending = 0U;
  SoftwareResetRequestTick = 0U;

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST) != RESET)
  {
    ResetReason |= RESET_REASON_PINRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST) != RESET)
  {
    ResetReason |= RESET_REASON_BORRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST) != RESET)
  {
    ResetReason |= RESET_REASON_SFTRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != RESET)
  {
    ResetReason |= RESET_REASON_IWDGRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) != RESET)
  {
    ResetReason |= RESET_REASON_WWDGRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST) != RESET)
  {
    ResetReason |= RESET_REASON_LPWRRST;
  }

  if (__HAL_RCC_GET_FLAG(RCC_FLAG_OBLRST) != RESET)
  {
    ResetReason |= RESET_REASON_OBLRST;
  }

  /*
   * Sonraki resetin eski flag'lerle karismamasi icin
   * mevcut reset flag'lerini temizle.
   */
  __HAL_RCC_CLEAR_RESET_FLAGS();

  /*
   * FE45 Reset Reason bu boot boyunca sabittir.
   * Yakalanan 16-bit maskeyi GATT veritabanina bir kez yaz.
   *
   * FE45 = uint16_t, little-endian.
   */
  UpdateCharData[0] =
      (uint8_t)(ResetReason & 0x00FFU);

  UpdateCharData[1] =
      (uint8_t)((ResetReason >> 8) & 0x00FFU);

  (void)Custom_STM_App_Update_Char(
      CUSTOM_STM_RESET_C,
      (uint8_t *)UpdateCharData
  );

  Custom_App_Context.Switch_c_Notification_Status = 0U;

  /*
   * Firmware baslangicinda LED'ler kapali.
   */
  HAL_GPIO_WritePin(LD1_GPIO_Port, LD1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(LD3_GPIO_Port, LD3_Pin, GPIO_PIN_RESET);

  /*
   * Butonlar active-low:
   *
   * GPIO_PIN_RESET = basili
   * GPIO_PIN_SET   = birakilmis
   *
   * Dizide:
   * [0] = SW1
   * [1] = SW2
   * [2] = SW3
   */

  Switch_StableState[0] =
      (HAL_GPIO_ReadPin(SW1_GPIO_Port, SW1_Pin) == GPIO_PIN_RESET)
      ? 1U
      : 0U;

  Switch_StableState[1] =
      (HAL_GPIO_ReadPin(SW2_GPIO_Port, SW2_Pin) == GPIO_PIN_RESET)
      ? 1U
      : 0U;

  Switch_StableState[2] =
      (HAL_GPIO_ReadPin(SW3_GPIO_Port, SW3_Pin) == GPIO_PIN_RESET)
      ? 1U
      : 0U;

  /*
   * Debounce baslangic degerleri.
   */
  for (uint8_t i = 0U; i < 3U; i++)
  {
    Switch_LastRawState[i] = Switch_StableState[i];
    Switch_SameSampleCount[i] = SW1_DEBOUNCE_SAMPLES;
    Switch_LastNotifiedState[i] = 0xFFU;
  }

  Switch_LastPollTick = HAL_GetTick();
  /*
   * ADC kalibrasyonunu bir kez yap.
   */
  if (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) != HAL_OK)
  {
    Error_Handler();
  }

  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */

static void Custom_APP_Update_Connection_Stats(void)
{
  /*
   * FE46 payload (5 bytes):
   *
   * Byte 0   = current BLE connection state (0 = disconnected, 1 = connected)
   * Byte 1-2 = total connection count since MCU boot, little-endian
   * Byte 3-4 = total disconnection count since MCU boot, little-endian
   */
  UpdateCharData[0] = BleConnectionActive;

  UpdateCharData[1] =
      (uint8_t)(BleConnectionCount & 0x00FFU);
  UpdateCharData[2] =
      (uint8_t)((BleConnectionCount >> 8) & 0x00FFU);

  UpdateCharData[3] =
      (uint8_t)(BleDisconnectionCount & 0x00FFU);
  UpdateCharData[4] =
      (uint8_t)((BleDisconnectionCount >> 8) & 0x00FFU);

  (void)Custom_STM_App_Update_Char(
      CUSTOM_STM_CONN_STATS,
      (uint8_t *)UpdateCharData
  );
}

static void Custom_APP_Update_Button_Counters(void)
{
  /*
   * FE47 payload (6 bytes):
   *
   * Byte 0-1 = SW1 press count since MCU boot, little-endian
   * Byte 2-3 = SW2 press count since MCU boot, little-endian
   * Byte 4-5 = SW3 press count since MCU boot, little-endian
   */
  UpdateCharData[0] =
      (uint8_t)(ButtonPressCount[0] & 0x00FFU);
  UpdateCharData[1] =
      (uint8_t)((ButtonPressCount[0] >> 8) & 0x00FFU);

