fratyaldiz/stm32wb55-projects/WB55_BLE_Phone_Control/STM32_WPAN/App/custom_app.c
  UpdateCharData[2] =
      (uint8_t)(ButtonPressCount[1] & 0x00FFU);
  UpdateCharData[3] =
      (uint8_t)((ButtonPressCount[1] >> 8) & 0x00FFU);

  UpdateCharData[4] =
      (uint8_t)(ButtonPressCount[2] & 0x00FFU);
  UpdateCharData[5] =
      (uint8_t)((ButtonPressCount[2] >> 8) & 0x00FFU);

  (void)Custom_STM_App_Update_Char(
      CUSTOM_STM_BUTTON_CNT,
      (uint8_t *)UpdateCharData
  );
}

static void Custom_APP_Update_Connection_Duration(void)
{
  uint32_t connection_seconds = 0U;

  /*
   * FE49 payload (4 bytes):
   * Current BLE connection duration in seconds, uint32 little-endian.
   */
  if (BleConnectionActive != 0U)
  {
    connection_seconds =
        (HAL_GetTick() - BleConnectionStartTick) / 1000U;
  }

  UpdateCharData[0] =
      (uint8_t)(connection_seconds & 0x000000FFU);
  UpdateCharData[1] =
      (uint8_t)((connection_seconds >> 8) & 0x000000FFU);
  UpdateCharData[2] =
      (uint8_t)((connection_seconds >> 16) & 0x000000FFU);
  UpdateCharData[3] =
      (uint8_t)((connection_seconds >> 24) & 0x000000FFU);

  (void)Custom_STM_App_Update_Char(
      CUSTOM_STM_CONN_TIME,
      (uint8_t *)UpdateCharData
  );
}

void Custom_APP_Process(void)
{
  uint32_t now;
  uint8_t raw_state[3];

  now = HAL_GetTick();

  /*
   * Execute an armed FE48 software reset outside the BLE callback.
   * The short delay gives the BLE write transaction time to finish cleanly.
   */
  if ((SoftwareResetPending != 0U) &&
      ((now - SoftwareResetRequestTick) >= SOFTWARE_RESET_DELAY_MS))
  {
    SoftwareResetPending = 0U;
    NVIC_SystemReset();
  }

  /*
   * Butonlari her 20 ms'de bir oku.
   */
  if ((now - Switch_LastPollTick) < SW1_POLL_PERIOD_MS)
  {
    return;
  }

  Switch_LastPollTick = now;

  /*
   * Butonlar active-low.
   *
   * basili    = 1
   * birakildi = 0
   */
  raw_state[0] =
      (HAL_GPIO_ReadPin(SW1_GPIO_Port, SW1_Pin) == GPIO_PIN_RESET)
      ? 1U : 0U;

  raw_state[1] =
      (HAL_GPIO_ReadPin(SW2_GPIO_Port, SW2_Pin) == GPIO_PIN_RESET)
      ? 1U : 0U;

  raw_state[2] =
      (HAL_GPIO_ReadPin(SW3_GPIO_Port, SW3_Pin) == GPIO_PIN_RESET)
      ? 1U : 0U;

  /*
   * Her buton icin debounce.
   */
  for (uint8_t i = 0U; i < 3U; i++)
  {
    if (raw_state[i] == Switch_LastRawState[i])
    {
      if (Switch_SameSampleCount[i] < SW1_DEBOUNCE_SAMPLES)
      {
        Switch_SameSampleCount[i]++;
      }
    }
    else
    {
      Switch_LastRawState[i] = raw_state[i];
      Switch_SameSampleCount[i] = 1U;
    }

    if (Switch_SameSampleCount[i] >= SW1_DEBOUNCE_SAMPLES)
    {
      /*
       * Count only a new debounced press transition:
       * released (0) -> pressed (1).
       */
      if ((Switch_StableState[i] == 0U) &&
          (Switch_LastRawState[i] == 1U))
      {
        if (ButtonPressCount[i] < 0xFFFFU)
        {
          ButtonPressCount[i]++;
        }
      }

      Switch_StableState[i] = Switch_LastRawState[i];
    }
  }

  /*
   * Telefon FE42 Notify'a aboneyse,
   * degisen butonlari telefona gonder.
   */
  if (Custom_App_Context.Switch_c_Notification_Status != 0U)
  {
    for (uint8_t i = 0U; i < 3U; i++)
    {
      if (Switch_LastNotifiedState[i] != Switch_StableState[i])
      {
        /*
         * Byte 0 = buton numarasi (01 / 02 / 03)
         * Byte 1 = durum      (00 / 01)
         */
        NotifyCharData[0] = i + 1U;
        NotifyCharData[1] = Switch_StableState[i];

        if (Custom_STM_App_Update_Char(
                CUSTOM_STM_SWITCH_C,
                (uint8_t *)NotifyCharData) == BLE_STATUS_SUCCESS)
        {
          Switch_LastNotifiedState[i] = Switch_StableState[i];
        }
      }
    }
  }
}
static HAL_StatusTypeDef Custom_APP_Read_Internal_ADC(
    uint32_t *vref_raw,
    uint32_t *temp_raw
)
{
  if ((vref_raw == NULL) || (temp_raw == NULL))
  {
    return HAL_ERROR;
  }

  /*
   * ADC sequence:
   *
   * Rank 1 = VREFINT
   * Rank 2 = TEMPSENSOR
   */
  if (HAL_ADC_Start(&hadc1) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /*
   * Rank 1: VREFINT
   */
  if (HAL_ADC_PollForConversion(&hadc1, 10U) != HAL_OK)
  {
    HAL_ADC_Stop(&hadc1);
    return HAL_TIMEOUT;
  }

  *vref_raw = HAL_ADC_GetValue(&hadc1);

  /*
   * Rank 2: internal temperature sensor
   */
  if (HAL_ADC_PollForConversion(&hadc1, 10U) != HAL_OK)
  {
    HAL_ADC_Stop(&hadc1);
    return HAL_TIMEOUT;
  }

  *temp_raw = HAL_ADC_GetValue(&hadc1);

  HAL_ADC_Stop(&hadc1);

  if (*vref_raw == 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
HAL_StatusTypeDef Custom_APP_Read_Internal_Temperature(
    int32_t *temperature_c
)
{
  uint32_t vref_raw;
  uint32_t temp_raw;
  uint32_t vdda_mv;
  HAL_StatusTypeDef status;

  if (temperature_c == NULL)
  {
    return HAL_ERROR;
  }

  status = Custom_APP_Read_Internal_ADC(
      &vref_raw,
      &temp_raw
  );

  if (status != HAL_OK)
  {
    return status;
  }

  /*
   * Gercek VDDA/VREF+ degerini hesapla.
   */
  vdda_mv =
      __HAL_ADC_CALC_VREFANALOG_VOLTAGE(
          vref_raw,
          ADC_RESOLUTION_12B
      );

  /*
   * Fabrika sicaklik kalibrasyon degerleri ile
   * MCU internal die temperature hesapla.
   */
  *temperature_c =
      __HAL_ADC_CALC_TEMPERATURE(
          vdda_mv,
          temp_raw,
          ADC_RESOLUTION_12B
      );

  return HAL_OK;
}
HAL_StatusTypeDef Custom_APP_Read_VDDA(
    uint32_t *vdda_mv
)
{
  uint32_t vref_raw;
  uint32_t temp_raw;
  HAL_StatusTypeDef status;

  if (vdda_mv == NULL)
  {
    return HAL_ERROR;
  }

  status = Custom_APP_Read_Internal_ADC(
      &vref_raw,
      &temp_raw
  );

  if (status != HAL_OK)
  {
    return status;
  }

  /*
   * VREFINT fabrika kalibrasyonunu kullanarak
   * gercek VDDA/VREF+ degerini mV cinsinden hesapla.
   */
  *vdda_mv =
      __HAL_ADC_CALC_VREFANALOG_VOLTAGE(
          vref_raw,
          ADC_RESOLUTION_12B
      );

  return HAL_OK;
}

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* My_P2P_Server */
__USED void Custom_Switch_c_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Switch_c_UC_1*/

  /* USER CODE END Switch_c_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SWITCH_C, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Switch_c_UC_Last*/

  /* USER CODE END Switch_c_UC_Last*/
  return;
}

__USED void Custom_Switch_c_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Switch_c_NS_1*/

  /*
   * SW1 notification kodunu bir sonraki adimda
   * buraya ekleyecegiz.
   */

  /* USER CODE END Switch_c_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SWITCH_C, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Switch_c_NS_Last*/

  /* USER CODE END Switch_c_NS_Last*/

  return;
}

/* Diagnostics_Service */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

/* USER CODE END FD_LOCAL_FUNCTIONS*/
